Revit 2024 API
ConceptualConstructionFloorSlabType Enumeration
 ConceptualConstructionType values for Floors.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum ConceptualConstructionFloorSlabType
Visual Basic
Public Enumeration ConceptualConstructionFloorSlabType
Visual C++
public enum class ConceptualConstructionFloorSlabType
Members
Member name | Description
InvalidFloorSlabTypeConstruction |  Invalid/not set Floor or Slab Type construction value
LightweightConstructionHighInsulation |  Lightweight Construction High Insulation Floor
LightweightConstructionTypicalInsulation |  Lightweight Construction Typical Insulation Floor
LightweightConstructionLowInsulation |  Lightweight Construction Low Insulation Floor
LightweightConstructionNoInsulationInterior |  Lightweight Construction No Insulation Interior Floor
HighMassConstructionFrigidClimateSlabInsulation |  High Mass Construction Frigid Climate Insulation Slab
HighMassConstructionColdClimateSlabInsulation |  High Mass Construction Cold Climate Insulation Slab
HighMassConstructionTypicalNoInsulation |  High Mass Construction Typical No Insulation Slab
NumFloorSlabTypeConstruction |  Total number of Floor/Slab Constructions
See Also
Autodesk.Revit.DB.Analysis Namespace